driver-tests/bpelse/misc/MiscBpel/src/duplicateOperationDifferentMessagePartElement/Echo2.wsdl

<?xml version="1.0" encoding="UTF-8"?><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link" xmlns:slnk1="http://schemas.xmlsoap.org/ws/2002/07/service-link/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://stc.com/DuplicateNamespace2/echo" xmlns:tns0="http://stc.com/DuplicateNamespace2/echo" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="echo" targetNamespace="http://stc.com/DuplicateNamespace2/echo">
    <types>
        <xsd:schema xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/" elementFormDefault="qualified" targetNamespace="http://stc.com/DuplicateNamespace2/echo">
            
                    
                    
                    <xsd:element name="item2">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="anotherName" type="xsd:string"/>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
        </xsd:schema>
    </types>
    <message name="echo">
        <part element="tns:item2" name="part"/>
    </message>
    <portType name="echo">
        <operation name="echo">
            <input message="tns:echo"/>
            <output message="tns:echo"/>
        </operation>
    </portType>
    <binding name="Binding" type="tns:echo">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="echo">
            <soap:operation soapAction="echo"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="echoService">
        <port binding="tns:Binding" name="port">
            <soap:address location="http://localhost:${HttpDefaultPort}/DuplicateNamespace2/echo2"/>
        </port>
    </service>
    <plnk:partnerLinkType xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" name="SLT">
        <plnk:role name="server" portType="tns:echo"/>
    </plnk:partnerLinkType>
</definitions>
