driver-tests/bpelse/misc/MiscJbi/test/EchoTest2/Output.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><item2 xmlns="http://stc.com/DuplicateNamespace2/echo"><anotherName>1</anotherName></item2></SOAP-ENV:Body></SOAP-ENV:Envelope>